{
	"title": "Importing Figma designs into Builder - Builder.io",
	"url": "https://www.builder.io/c/docs/import-from-figma",
	"html": "Import from Figma\n\nThe Builder Figma plugin helps you import your Figma design directly into Builder while letting AI take care of the details — no more manually rasterizing, applying auto layout, or figuring out all the responsiveness.\n\nImport your Figma designs into Builder to create a Page or Section, complete with responsive styles.\n\nPrerequisites\n\nBefore importing your Figma design into Builder, make sure:\n\nYou've installed the Builder.io plugin for Figma.\nYou have a completed design in Figma.\nImporting Figma Designs to Builder\n\nThe AI features in the Builder plugin take care of all the details—including rasterizing images, applying auto layout, and making the design responsive in Builder.\n\nTo import your Figma design into Builder using AI:\n\nIn your Figma file, select the frame(s) you'd like to import into Builder.\nIn Figma, open the Builder plugin by clicking on Resources in the toolbar and going to the Plugins tab.\nClick the Generate Code button.\nThis workflow launches a Builder fiddle with your content, which you can copy and paste into another Builder document or save as a template.\nGet pro tips on importing your design\n\n\nFor the best experience and a deeper understanding of how the plugin works, get familiar with Best Practices with Builder's Figma Plugin.\n\nThough you don't have to do any prep to your Figma file before using the plugin, you can optionally apply Auto Layout as a guide for the AI, especially if you're finding that your design could use some extra help.\n\nThe video below shows how to import your Figma design into Builder using the plugin's AI feature. This example uses a full page, but importing a section design is the same.\n\nPasting Figma layers into Builder\n\nEffortlessly copy and paste your Figma designs into Builder with the Builder Figma plugin. This workflow is great for when you need to update an existing Page or Section; for example, design updates to a hero.\n\nTo import layers from Figma into Builder using the Figma plugin:\n\nSelect the layer(s) in Figma.\nOpen the Builder Figma plugin and expand the options in the Generate code button.\nSelect Copy & Paste Designs.\nWhen the copy process is done, go to the Builder Visual Editor and paste with Cmd/Ctrl + v.\n\nThe next video shows this process.\n\nUsing Figma in Dev Mode\n\nThe Builder Figma Plugin works just as well in Figma's Dev Mode as it does in full editing mode.\n\nBest practices\n\nFor more detail on making the most of the Builder Figma Plugin, visit Best Practices with Builder's Figma Plugin.\n\nHow AI contributes\n\nCertain parts of this workflow use AI, for more information, read How Builder Uses AI.\n\nHelp us meet your needs\n\nThe Builder team works daily to make improvements and iterate on functionality. As we continue to solve for a broader range of use cases, some designs might benefit from extra help so that the AI can process the import better.\n\nIf your design is a candidate for helping us learn how to better meet your needs, we invite you to share your feedback. While we work with your feedback, we recommend Best Practices with Builder's Figma Plugin.\n\nWhat's next: get your code\n\nAfter importing your Figma design into Builder — or creating a design from scratch in Builder — you can generate semantic code for your design and sync that code with your codebase. For instructions, visit Generate Code."
}